code/app/controllers/study_guides_controller.rb

SELECT "study_guides".* FROM "study_guides"
---
  def index
    @study_guides = StudyGuide.all

INSERT INTO "study_guides" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "BOb"], ["created_at", "2018-04-17 10:18:21.318194"], ["updated_at", "2018-04-17 10:18:21.318194"]]
---
  def create
    @study_guide = StudyGuide.new(study_guide_params)
    #wicked_pdf stuff

    if @study_guide.save

DELETE FROM "study_guides" WHERE "study_guides"."id" = ?  [["id", 1]]
---
  def destroy
    @study_guide.destroy

SELECT  "study_guides".* FROM "study_guides" WHERE "study_guides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_study_guide
    @study_guide = StudyGuide.find(params[:id])